In [1]:
import numpy as np
import pandas as pd

In [ ]:
"""
DataFrame.merge(left, right, 
                how='inner',
                on=None,
                left_on=None,
                right_on=None,
                sort=False,
                suffixes=('x_', '_y'))
"""

In [4]:
df1 = pd.DataFrame({'key': ['a', 'b', 'b'],
                    'data1': range(3)})
df1

  key  data1
0   a      0
1   b      1
2   b      2

In [6]:
df2 = pd.DataFrame({'key': ['a', 'b', 'c'],
                    'data2': range(3, 6)})
df2

  key  data2
0   a      3
1   b      4
2   c      5

In [7]:
df3 = pd.DataFrame({'key': ['b', 'c',' d'],
                    'data3': range(6, 9)})
df3

  key  data3
0   b      6
1   c      7
2   d      8

In [8]:
df4 = pd.DataFrame({'key': ['a', 'b', 'c'],
                    'data4': range(9, 12)})
df4

  key  data4
0   a      9
1   b     10
2   c     11

In [9]:
pd.merge(df1, df2)

  key  data1  data2
0   a      0      3
1   b      1      4
2   b      2      4

In [10]:
df1.merge(df2)

  key  data1  data2
0   a      0      3
1   b      1      4
2   b      2      4

In [ ]:
""" how """
# 'inner' (default)
# 'outer'
# 'right'
# 'left'

In [11]:
# inner, keep what's in both df
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   a      0      3
1   b      1      4
2   b      2      4

In [12]:
# outer, keep everything, filled with NaN  
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a    0.0      3
1   b    1.0      4
2   b    2.0      4
3   c    NaN      5

In [13]:
# left, keep the df on the left
pd.merge(df1, df2, how='left')

  key  data1  data2
0   a      0      3
1   b      1      4
2   b      2      4

In [14]:
# right, keep the df on the right
pd.merge(df1, df2, how='right')

  key  data1  data2
0   a    0.0      3
1   b    1.0      4
2   b    2.0      4
3   c    NaN      5

In [15]:
""" on """
left1 = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                       'a': ['a0', 'a1', 'a2', 'a3'],
                       'b': ['b0', 'b1', 'b2', 'b3']})
right1 = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                        'c': ['c0', 'c1', 'c2', 'c3'],
                        'd': ['d0', 'd1', 'd2', 'd3']})
pd.merge(left1, right1, on='key')

  key   a   b   c   d
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c3  d3

In [24]:
left2 = pd.DataFrame({'key1': ['k0', 'k0', 'k1', 'k2'],
                      'key2': ['k0', 'k1', 'k0', 'k1'],
                        'a': ['a0', 'a1', 'a2', 'a3'],
                        'b': ['b0', 'b1', 'b2', 'b3']})
right2 = pd.DataFrame({'key1': ['k0', 'k1', 'k1', 'k2'],
                       'key2': ['k0', 'k0', 'k0', 'k0'],
                         'c': ['c0', 'c1', 'c2', 'c3'],
                         'd': ['d0', 'd1', 'd2', 'd3']})
print(left2)
print(right2)
pd.merge(left2, right2, on=['key1', 'key2'])

  key1 key2   a   b
0   k0   k0  a0  b0
1   k0   k1  a1  b1
2   k1   k0  a2  b2
3   k2   k1  a3  b3
  key1 key2   c   d
0   k0   k0  c0  d0
1   k1   k0  c1  d1
2   k1   k0  c2  d2
3   k2   k0  c3  d3

  key1 key2   a   b   c   d
0   k0   k0  a0  b0  c0  d0
1   k1   k0  a2  b2  c1  d1
2   k1   k0  a2  b2  c2  d2

In [25]:
"""left_on, right_on"""
# the keys have the same values but different names
df5 = pd.DataFrame({'l_key': ['b', 'c', 'd'],
                    'data5': range(6, 9)})
df6 = pd.DataFrame({'r_key': ['b', 'c', 'd'],
                    'data6': range(9, 12)})                   
pd.merge(df5, df6, left_on='l_key', right_on='r_key')

  l_key  data5 r_key  data6
0     b      6     b      9
1     c      7     c     10
2     d      8     d     11

In [28]:
df7 = pd.DataFrame({'key': ['b', 'c', 'd'],
                    'data': range(5, 8)})
df8 = pd.DataFrame({'key': ['b', 'c', 'd'],
                    'data': [9, 5, 8]})
pd.merge(df7, df8, on='key', suffixes=['_a', '_b'])

  key  data_a  data_b
0   b       5       9
1   c       6       5
2   d       7       8

In [31]:
""" sort (by key) """
df9 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                   'key': ['k0', 'k1', 'k0', 'k1']})
df10 = pd.DataFrame({'c': ['c0', 'c1'],
                     'd': ['d0', 'd1']},
                    index=['k0', 'k1'])
print(df9)
print(df10)
pd.merge(df9, df10, left_on='key', right_index=True, how='left', sort=False)

    a   b key
0  a0  b0  k0
1  a1  b1  k1
2  a2  b2  k0
3  a3  b3  k1
     c   d
k0  c0  d0
k1  c1  d1

    a   b key   c   d
0  a0  b0  k0  c0  d0
1  a1  b1  k1  c1  d1
2  a2  b2  k0  c0  d0
3  a3  b3  k1  c1  d1

In [32]:
pd.merge(df9, df10, left_on='key', right_index=True, how='left', sort=True)

    a   b key   c   d
0  a0  b0  k0  c0  d0
2  a2  b2  k0  c0  d0
1  a1  b1  k1  c1  d1
3  a3  b3  k1  c1  d1

In [41]:
""" concat """
data1 = pd.DataFrame({'key1': ['maths', 'chinese', 'english'],
                      'value': [87, 92, 83]})
data2 = pd.DataFrame({'key1': ['maths', 'chinese', 'english'],
                      'value': [97, 82, 76]})
pd.concat([data1, data2])  # axis=0 by default

      key1  value
0    maths     87
1  chinese     92
2  english     83
0    maths     97
1  chinese     82
2  english     76

In [35]:
pd.concat([data1, data2], axis=1)

      key1  value     key1  value
0    maths     87    maths     97
1  chinese     92  chinese     82
2  english     83  english     76

In [37]:
# change the index
pd.concat([data1, data2], ignore_index=True)

      key1  value
0    maths     87
1  chinese     92
2  english     83
3    maths     97
4  chinese     82
5  english     76

In [38]:
# concat multiple
pd.concat([data1, data2, data2], ignore_index=True)

      key1  value
0    maths     87
1  chinese     92
2  english     83
3    maths     97
4  chinese     82
5  english     76
6    maths     97
7  chinese     82
8  english     76

In [42]:
"""join"""
data3 = pd.DataFrame({'key3': ['maths', 'chinese', 'english'],
                      'value': [95, 88, 89]})
data4 = pd.DataFrame({'key4': ['maths', 'chinese', 'english'],
                      'value': [90, 83, 94]})
pd.concat([data3, data4], join='outer')

      key3  value     key4
0    maths     95      NaN
1  chinese     88      NaN
2  english     89      NaN
0      NaN     90    maths
1      NaN     83  chinese
2      NaN     94  english

In [43]:
pd.concat([data3, data4], join='inner') # only concat the same col names

   value
0     95
1     88
2     89
0     90
1     83
2     94

In [45]:
s1 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                  columns=['letter', 'number', 'animal'])
s2 = pd.DataFrame([['a', 1], ['b', 2]],
                  columns=['letter', 'number'])
print(s1)
print(s2)
pd.concat([s1, s2], sort=False)

  letter  number animal
0      c       3    cat
1      d       4    dog
  letter  number
0      a       1
1      b       2

  letter  number animal
0      c       3    cat
1      d       4    dog
0      a       1    NaN
1      b       2    NaN

In [46]:
pd.concat([s1, s2], sort=True) # sort by column names

  animal letter  number
0    cat      c       3
1    dog      d       4
0    NaN      a       1
1    NaN      b       2

In [47]:
"""
df.append(other, ignore_index=False, verigy_integrity=False. sort=False)
"""
data3.append(data4)  # =pd.concat([data3, data4])

      key3  value     key4
0    maths     95      NaN
1  chinese     88      NaN
2  english     89      NaN
0      NaN     90    maths
1      NaN     83  chinese
2      NaN     94  english

In [48]:
# change the index
data3.append(data4, ignore_index=True) # =pd.concat([data3, data4], ignore_index=True)

      key3  value     key4
0    maths     95      NaN
1  chinese     88      NaN
2  english     89      NaN
3      NaN     90    maths
4      NaN     83  chinese
5      NaN     94  english

In [50]:
# sort by column names
data3.append(data4, ignore_index=True, sort=True)

      key3     key4  value
0    maths      NaN     95
1  chinese      NaN     88
2  english      NaN     89
3      NaN    maths     90
4      NaN  chinese     83
5      NaN  english     94

In [51]:
"""
df.join(other, on=None, how='left', lsuffix='', rsuffix='', sort=False)
"""
data5 = pd.DataFrame({'a': [61, 97, 88], 'b': [93, 88, 78]},
                     index=['k0', 'k1', 'k2'])
data6 = pd.DataFrame({'c': [95, 77, 80], 'd': [80, 98, 84]},
                     index=['k0', 'k1', 'k2'])
print(data5)
print(data5)
data5.join(data6) # =pd.concat([data5, data6], axis=1)

     a   b
k0  61  93
k1  97  88
k2  88  78
     a   b
k0  61  93
k1  97  88
k2  88  78

     a   b   c   d
k0  61  93  95  80
k1  97  88  77  98
k2  88  78  80  84

In [53]:
pd.concat([data5, data6], axis=1)

     a   b   c   d
k0  61  93  95  80
k1  97  88  77  98
k2  88  78  80  84

In [58]:
"""suffix for same column names"""
data7 = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3', 'k4', 'k5'],
                       'a': ['a0', 'a1', 'a2', 'a3', 'a4', 'a5']})
data8 = pd.DataFrame({'key': ['k0', 'k1', 'k2'],
                       'b': ['b0', 'b1', 'b2']})
print(data7)
print(data8)
data7.join(data8, lsuffix='_left', rsuffix='_right')

  key   a
0  k0  a0
1  k1  a1
2  k2  a2
3  k3  a3
4  k4  a4
5  k5  a5
  key   b
0  k0  b0
1  k1  b1
2  k2  b2

  key_left   a key_right    b
0       k0  a0        k0   b0
1       k1  a1        k1   b1
2       k2  a2        k2   b2
3       k3  a3       NaN  NaN
4       k4  a4       NaN  NaN
5       k5  a5       NaN  NaN

In [59]:
data8.join(data7, rsuffix='-2')

  key   b key-2   a
0  k0  b0    k0  a0
1  k1  b1    k1  a1
2  k2  b2    k2  a2

In [60]:
# make the shared column the index
data7.set_index('key').join(data8.set_index('key'))

      a    b
key
k0   a0   b0
k1   a1   b1
k2   a2   b2
k3   a3  NaN
k4   a4  NaN
k5   a5  NaN

In [62]:
# keep the share column once
data7.join(data8.set_index('key'), on='key')

  key   a    b
0  k0  a0   b0
1  k1  a1   b1
2  k2  a2   b2
3  k3  a3  NaN
4  k4  a4  NaN
5  k5  a5  NaN

In [64]:
data7.join(data8.set_index('key'), on='key').set_index('key')

      a    b
key
k0   a0   b0
k1   a1   b1
k2   a2   b2
k3   a3  NaN
k4   a4  NaN
k5   a5  NaN